dev.to/2024-09-01-conector-lambda-sink-localstack/jmeter-producer-kafka.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.0 r1840935">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="Test Plan" enabled="true">
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.tearDown_on_shutdown">true</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
        <collectionProp name="Arguments.arguments"/>
      </elementProp>
    </TestPlan>
    <hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Thread Group" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <stringProp name="LoopController.loops">10</stringProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">5</stringProp>
        <stringProp name="ThreadGroup.ramp_time">10</stringProp>
        <boolProp name="ThreadGroup.scheduler">false</boolProp>
      </ThreadGroup>
      <hashTree>
        <com.di.jmeter.kafka.sampler.KafkaProducerSampler guiclass="TestBeanGUI" testclass="com.di.jmeter.kafka.sampler.KafkaProducerSampler" testname="Kafka Producer Sampler" enabled="true">
          <stringProp name="kafkaMessage">{&quot;value&quot;: &quot;teste com producer jmeter ${counter}&quot;}</stringProp>
          <stringProp name="kafkaMessageKey">${counter}</stringProp>
          <stringProp name="kafkaProducerClientVariableName">KafkaProducerClient</stringProp>
          <stringProp name="kafkaTopic">example-stream</stringProp>
          <collectionProp name="messageHeaders"/>
        </com.di.jmeter.kafka.sampler.KafkaProducerSampler>
        <hashTree/>
        <com.di.jmeter.kafka.config.KafkaProducerConfig guiclass="TestBeanGUI" testclass="com.di.jmeter.kafka.config.KafkaProducerConfig" testname="Kafka Producer Config" enabled="true">
          <stringProp name="batchSize">16384</stringProp>
          <stringProp name="clientId"> JMeter-Producer-1</stringProp>
          <collectionProp name="extraConfigs"/>
          <stringProp name="kafkaBrokers">localhost:9092</stringProp>
          <stringProp name="kafkaProducerClientVariableName">KafkaProducerClient</stringProp>
          <stringProp name="kafkaSslKeystorePassword">Chang3M3</stringProp>
          <stringProp name="kafkaSslPrivateKeyPass">Chang3M3</stringProp>
          <stringProp name="kafkaSslTruststorePassword">Chang3M3</stringProp>
          <stringProp name="securityType">securityType.plaintext</stringProp>
          <stringProp name="serializerKey">org.apache.kafka.common.serialization.StringSerializer</stringProp>
          <stringProp name="serializerValue">org.apache.kafka.common.serialization.StringSerializer</stringProp>
        </com.di.jmeter.kafka.config.KafkaProducerConfig>
        <hashTree/>
        <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="View Results Tree" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
        <RandomVariableConfig guiclass="TestBeanGUI" testclass="RandomVariableConfig" testname="Random Variable" enabled="true">
          <stringProp name="maximumValue">1000</stringProp>
          <stringProp name="minimumValue">1</stringProp>
          <boolProp name="perThread">false</boolProp>
          <stringProp name="variableName">random_numbers</stringProp>
        </RandomVariableConfig>
        <hashTree/>
        <CounterConfig guiclass="CounterConfigGui" testclass="CounterConfig" testname="counter" enabled="true">
          <stringProp name="CounterConfig.start">1</stringProp>
          <stringProp name="CounterConfig.end">1000</stringProp>
          <stringProp name="CounterConfig.incr">1</stringProp>
          <stringProp name="CounterConfig.name">counter</stringProp>
          <boolProp name="CounterConfig.per_user">false</boolProp>
        </CounterConfig>
        <hashTree/>
      </hashTree>
    </hashTree>
  </hashTree>
</jmeterTestPlan>